# порождающий полином
p = [1, 0, 0, 0, 1, 1, 0, 1, 1]

# функции инжекции сообщения (для инициализации)
func_inj3 = [[3, 2, 2, 1], [2, 3, 2, 2], [2, 2, 3, 4]]
func_inj4 = [[4, 6, 6, 7, 1], [7, 4, 6, 6, 2], [6, 7, 4, 6, 4], [6, 6, 7, 4, 8]]
func_inj5 = [[15, 8, 10, 10, 8, 1], [8, 15, 8, 10, 10, 2], [10, 8, 15, 8, 10, 4], [10, 10, 8, 15, 8, 8], [8, 10, 10, 8, 15, 16]]

# Блоки для замены SubCrumb
blocks_for_subcrumb = ['0111', '1101', '1011', '1010', '1100', '0100', '1000', '0011', '0101', '1111', '0110', '0000', '1001', '0001', '0010', '1110']

v0 = [109, 37, 30, 105, 68, 176, 81, 224, 78, 170, 111, 180, 219, 247, 132, 101, 110, 41, 32, 17, 144, 21, 45, 244, 238, 5, 129, 57, 222, 246, 16, 187]
v1 = [195, 180, 75, 149, 217, 210, 242, 86, 112, 238, 233, 160, 222, 9, 159, 163, 93, 155, 5, 87, 143, 201, 68, 179, 207, 28, 207, 14, 116, 108, 213, 129]
v2 = [247, 239, 200, 157, 93, 186, 87, 129, 4, 1, 108, 229, 173, 101, 156, 5, 3, 6, 25, 79, 102, 109, 24, 54, 36, 170, 35, 10, 139, 38, 74, 231]
v3 = [133, 128, 117, 213, 54, 215, 156, 206, 229, 113, 247, 215, 32, 75, 31, 103, 53, 135, 12, 106, 87, 233, 233, 35, 20, 188, 184, 8, 124, 222, 114, 206]
v4 = [108, 104, 233, 190, 94, 196, 30, 34, 200, 37, 183, 199, 175, 251, 67, 99, 245, 223, 57, 153, 15, 198, 136, 241, 176, 114, 36, 204, 3, 232, 108, 234]

# для нулевого блока (чередуются нулевой и четвёртый)
consts_0 = [[48, 57, 148, 166], [224, 51, 120, 24], [192, 230, 82, 153], [68, 27, 169, 13], [108, 195, 58, 18], [127, 52, 212, 66], [220, 86, 152, 62], [147, 137, 33, 127], [30, 0, 16, 143], [229, 168, 188, 230], [120, 0, 66, 61], [82, 116, 186, 244], [143, 91, 120, 130], [38, 136, 155, 167], [150, 225, 219, 18], [154, 34, 110, 157]]

# для первого блока (чередуются нулевой и четвёртый)
consts_1 = [[182, 222, 16, 237], [1, 104, 95, 61], [112, 244, 122, 174], [5, 161, 124, 244], [7, 7, 163, 212], [189, 9, 202, 202], [28, 30, 143, 81], [244, 39, 43, 40], [112, 122, 61, 69], [20, 74, 229, 204], [174, 178, 133, 98], [250, 167, 174, 43], [186, 202, 21, 137], [46, 72, 241, 193], [64, 164, 111, 62], [185, 35, 199, 4]]

# для второго блока (чередуются нулевой и четвёртый)
consts_2 = [[252, 32, 217, 210], [226, 94, 114, 193], [52, 85, 46, 37], [230, 35, 187, 114], [122, 216, 129, 143], [92, 88, 164, 164], [132, 56, 118, 74], [30, 56, 226, 231], [187, 109, 224, 50], [120, 227, 139, 157], [237, 183, 128, 200], [39, 88, 103, 25], [217, 132, 115, 86], [54, 237, 165, 127], [162, 199, 132, 52], [112, 58, 172, 231]]

# для третьего блока (чередуются нулевой и четвёртый)
consts_3 = [[178, 19, 175, 165], [224, 40, 201, 191], [200, 78, 190, 149], [68, 117, 111, 145], [78, 96, 138, 34], [126, 143, 206, 50], [86, 216, 88, 254], [149, 101, 72, 190], [52, 59, 19, 143], [254, 25, 27, 226], [208, 236, 78, 61], [60, 178, 38, 229], [44, 235, 72, 130], [89, 68, 162, 142], [179, 173, 34, 8], [161, 196, 195, 85]]

# для четвёртого блока (чередуются нулевой и четвёртый)
consts_4 = [[240, 210, 233, 227], [80, 144, 213, 119], [172, 17, 215, 250], [45, 25, 37, 171], [27, 203, 102, 242], [180, 100, 150, 172], [111, 45, 155, 201], [209, 146, 90, 176], [120, 96, 38, 73], [41, 19, 26, 182], [142, 218, 233, 82], [15, 192, 83, 195], [59, 107, 165, 72], [63, 1, 79, 12], [237, 174, 149, 32], [252, 5, 60, 49]]

def amount_of_zeros(l):
    return 255 - (l % 256)

def Add(a, b):
    return a ^ b

def Div(a):
    curr = 15
    for i in range(15):
        if a[i] == 1:
            curr = i
            break
    while curr < 7:
        for j in range(9):
            a[j+curr] = (p[j] + a[j+curr]) % 2
        for i in range(15):
            if a[i] == 1:
                curr = i
                break
    return int(''.join([str(x) for x in a]), 2)

def Multi(a, b):
    a, b = bin(a)[2:], [int(x) for x in bin(b)[2:]]
    l, c = len(a), [0 for _ in range(15)]
    for i in range(l-1, -1, -1):
        if a[i] == '1':
            start, l_b = 14 - ((l-1) - i), len(b)
            end, diff = start - l_b, start - (l_b - 1)
            for j in range(start, end, -1):
                print(j, j-diff)
                c[j] = (c[j] + b[j-diff]) % 2
    return Div(c)

def Multi_Matrix(b):
    n, m = len(func_inj3), len(b) # длина строки (параметр w); b - текущий обрабатываемый кусок
    res = [[0 for _ in range(32)] for _ in range(n)]
    for i in range(n):
        for j in range(m):
            curr, z = func_inj3[i][j], []
            for each in b[j]:
                value = Multi(each, curr)
                z.append(value)
            for k in range(32):
                res[i][k] = Add(res[i][k], z[k])
    return res

def Trans(a): # переводит массив байт в строку соответствующего числа бит
    result = ''
    for number in a:
        curr_byte = bin(number)[2:]
        result += '0'*(8-len(curr_byte)) + curr_byte
    return result

def Shift(n, d): # реализует сдвиг на d
    return ( (n << d) % 2**32 ) | (n >> (32 - d))

def bin32(a): # переводит число к 32 символьной двоичной строке
    result = bin(a)[2:]
    return (32-len(result))*'0'+result

def opp_Trans(a): # переводит 32-символьную строку в массив из 4 байт
    result = []
    for i in range(4):
        curr = a[i*8:i*8+8]
        result.append(int(curr, 2))
    return result

def SubCrumb(a):
    for l in range(32):
        number_of_block = int(a[3][l] + a[2][l] + a[1][l] + a[0][l], 2)
        curr_block = blocks_for_subcrumb[number_of_block]
        for j in range(3, -1, -1):
            a[j][l] = curr_block[j]
    return a

def Mix_Word(x, x4):
    x, x4 = int(Trans(x), 2), int(Trans(x4), 2) ## переводим числа
    y4 = Add(x, x4)
    y = Shift(x, 2)
    y = Add(y, y4)
    y4 = Shift(y4, 14)
    y4 = Add(y, y4)
    y = Shift(y, 10)
    y = Add(y, y4)
    y4 = Shift(y4, 1)
    return opp_Trans(bin32(y)), opp_Trans(bin32(y4))

def Add_Constant(a0, a4):


def Permutation(b):
    for curr_block, j in enumerate(b):
        a = []
        for i in range(8):
            a.append(curr_block[4*i:4*i+4])
        for _ in range(8):
            pass











